[
  {
    "id": "morning-habits",
    "title": "Small Morning Habits",
    "level": "A2",
    "paragraphs": [
      "Many students want better English, but they feel busy in the morning.",
      "A small habit can change this. Read one short paragraph after you wake up.",
      "Do not wait for perfect time. Five focused minutes every day create real progress."
    ]
  },
  {
    "id": "city-parks",
    "title": "Why City Parks Matter",
    "level": "B1",
    "paragraphs": [
      "City parks are open classrooms for people of all ages.",
      "Children run, older people walk, and workers rest there after long meetings.",
      "A park gives fresh air, social connection, and a quiet place to think."
    ]
  },
  {
    "id": "reading-speed",
    "title": "Reading Faster with Purpose",
    "level": "B1",
    "paragraphs": [
      "Speed is useful, but understanding is the main goal.",
      "Before reading, ask one question: what do I need from this text?",
      "When your purpose is clear, your eyes and mind move together."
    ]
  },
  {
    "id": "tea-culture",
    "title": "A Short Story of Tea",
    "level": "A2",
    "paragraphs": [
      "Tea is more than a drink in many countries.",
      "People use tea time to welcome guests, share news, and slow down.",
      "Even one warm cup can make a difficult day feel calmer."
    ]
  },
  {
    "id": "work-breaks",
    "title": "The Science of Breaks",
    "level": "B2",
    "paragraphs": [
      "Continuous work can reduce attention after a short period.",
      "Research suggests that simple breaks support memory and decision quality.",
      "Stand up, stretch, or take a short walk to reset your focus."
    ]
  },
  {
    "id": "learn-words",
    "title": "Remembering New Words",
    "level": "B1",
    "paragraphs": [
      "A new word becomes useful only when you meet it many times.",
      "Write one sentence with the word and read that sentence aloud.",
      "Review your saved list every week, and remove words you already use naturally."
    ]
  },
  {
    "id": "smart-commute",
    "title": "Learning During a Commute",
    "level": "A2",
    "paragraphs": [
      "Commuting time can feel long, but it is a chance to learn.",
      "Read short articles on your phone and save difficult words quickly.",
      "Ten minutes on a train each day can become sixty minutes each week."
    ]
  },
  {
    "id": "team-feedback",
    "title": "Giving Better Feedback",
    "level": "B2",
    "paragraphs": [
      "Good feedback is specific, kind, and action oriented.",
      "Start with one observed fact, then explain the impact clearly.",
      "Finally, suggest one next step so the other person can improve immediately."
    ]
  },
  {
    "id": "sleep-and-memory",
    "title": "Sleep and Memory",
    "level": "B1",
    "paragraphs": [
      "Sleep helps the brain organize information from the day.",
      "When people sleep well, they often remember details more accurately.",
      "For language learners, rest is not optional; it is part of practice."
    ]
  },
  {
    "id": "build-curiosity",
    "title": "Build Curiosity Every Day",
    "level": "A2",
    "paragraphs": [
      "Curiosity starts with small questions about normal things.",
      "Ask why a headline uses one word instead of another word.",
      "Curious readers learn faster because each sentence becomes a tiny discovery."
    ]
  }
]
