[
  {
    "id": "morning-habits",
    "title": "Small Morning Habits",
    "level": "A2",
    "paragraphs": [
      "Many students want better English, but they feel busy in the morning.",
      "A small habit can change this. Read one short paragraph after you wake up.",
      "Do not wait for perfect time. Five focused minutes every day create real progress."
    ],
    "translations": [
      "许多学生想学好英语，但早上觉得很忙。",
      "一个小习惯可以改变这一点。起床后读一小段。",
      "不要等待完美时机。每天专注五分钟就能带来真正进步。"
    ]
  },
  {
    "id": "city-parks",
    "title": "Why City Parks Matter",
    "level": "B1",
    "paragraphs": [
      "City parks are open classrooms for people of all ages.",
      "Children run, older people walk, and workers rest there after long meetings.",
      "A park gives fresh air, social connection, and a quiet place to think."
    ],
    "translations": [
      "城市公园是面向各个年龄段的开放课堂。",
      "孩子在跑，老人散步，工人在长会议后在那里休息。",
      "公园提供新鲜空气、社交连接和安静思考的地方。"
    ]
  },
  {
    "id": "reading-speed",
    "title": "Reading Faster with Purpose",
    "level": "B1",
    "paragraphs": [
      "Speed is useful, but understanding is the main goal.",
      "Before reading, ask one question: what do I need from this text?",
      "When your purpose is clear, your eyes and mind move together."
    ],
    "translations": [
      "速度有用，但理解才是主要目标。",
      "阅读前问自己一个问题：我需要从这段文字获得什么？",
      "当目的明确时，你的眼睛和思维会同步。"
    ]
  },
  {
    "id": "tea-culture",
    "title": "A Short Story of Tea",
    "level": "A2",
    "paragraphs": [
      "Tea is more than a drink in many countries.",
      "People use tea time to welcome guests, share news, and slow down.",
      "Even one warm cup can make a difficult day feel calmer."
    ],
    "translations": [
      "在许多国家，茶不仅仅是一种饮品。",
      "人们用茶时间来欢迎客人、分享消息并放慢节奏。",
      "即使一杯热茶也能让艰难的一天更平静。"
    ]
  },
  {
    "id": "work-breaks",
    "title": "The Science of Breaks",
    "level": "B2",
    "paragraphs": [
      "Continuous work can reduce attention after a short period.",
      "Research suggests that simple breaks support memory and decision quality.",
      "Stand up, stretch, or take a short walk to reset your focus."
    ],
    "translations": [
      "持续工作在短时间后会降低注意力。",
      "研究表明，简单的休息有助于记忆和决策质量。",
      "站起来伸展一下，或短暂散步来重置注意力。"
    ]
  },
  {
    "id": "learn-words",
    "title": "Remembering New Words",
    "level": "B1",
    "paragraphs": [
      "A new word becomes useful only when you meet it many times.",
      "Write one sentence with the word and read that sentence aloud.",
      "Review your saved list every week, and remove words you already use naturally."
    ],
    "translations": [
      "一个新词只有在多次遇到后才变得有用。",
      "用这个词写一句话，并大声朗读。",
      "每周复习你的收藏列表，移除已经能自然使用的词。"
    ]
  },
  {
    "id": "smart-commute",
    "title": "Learning During a Commute",
    "level": "A2",
    "paragraphs": [
      "Commuting time can feel long, but it is a chance to learn.",
      "Read short articles on your phone and save difficult words quickly.",
      "Ten minutes on a train each day can become sixty minutes each week."
    ],
    "translations": [
      "通勤时间可能很长，但也是学习的机会。",
      "在手机上读短文，快速保存难词。",
      "每天在车上十分钟，每周就有六十分钟。"
    ]
  },
  {
    "id": "team-feedback",
    "title": "Giving Better Feedback",
    "level": "B2",
    "paragraphs": [
      "Good feedback is specific, kind, and action oriented.",
      "Start with one observed fact, then explain the impact clearly.",
      "Finally, suggest one next step so the other person can improve immediately."
    ],
    "translations": [
      "好的反馈要具体、友善且面向行动。",
      "从一个观察到的事实开始，然后清楚说明影响。",
      "最后提出一个下一步建议，让对方立刻改进。"
    ]
  },
  {
    "id": "sleep-and-memory",
    "title": "Sleep and Memory",
    "level": "B1",
    "paragraphs": [
      "Sleep helps the brain organize information from the day.",
      "When people sleep well, they often remember details more accurately.",
      "For language learners, rest is not optional; it is part of practice."
    ],
    "translations": [
      "睡眠帮助大脑整理一天的信息。",
      "睡得好的人往往更准确地记住细节。",
      "对语言学习者来说，休息不是可选项，而是练习的一部分。"
    ]
  },
  {
    "id": "build-curiosity",
    "title": "Build Curiosity Every Day",
    "level": "A2",
    "paragraphs": [
      "Curiosity starts with small questions about normal things.",
      "Ask why a headline uses one word instead of another word.",
      "Curious readers learn faster because each sentence becomes a tiny discovery."
    ],
    "translations": [
      "好奇心从对普通事物的小问题开始。",
      "问一问为什么标题用这个词而不是另一个词。",
      "好奇的读者学得更快，因为每句话都是一次小发现。"
    ]
  }
]
